{
  "courses": [
    "NACT-230: Introduction to Programming",
    "NMAD-155: Survey of Visual Design",
    "NMAD-180: Programming Fundamentals I: Mobile Domain",
    "NACA-120: Problem Analysis and Software Development I",
    "ISTE-140: Web and Mobile I",
    "ISTE-240: Web and Mobile II",
    "ISTE-262: Foundations of Human-Centered Computing",
    "NACA-121: Survey of Computational Problem Analysis II",
    "ISTE-252: Foundations of Mobile Design",
    "STAT-145: Introduction to Statistics I",
    "STAT-146: Introduction of Statistics II",
    "GCIS-124: Software Development and Problem Solving II",
    "PSYC-250: Research Methods I",
    "PSYC-251: Research Methods II",
    "NMDE-112: New Media Design Digital Survey II",
    "PSYC-223: Cognitive Psychology",
    "ISTE-340: Client Programming",
    "UWRT-150: FYW: Writing Seminar"
  ],
  "descriptions": [
    "This course introduces students to the fundamental concepts and terminology of computer programming. Emphasis will be placed on developing problem-solving skills in designing and writing simple computer programs. The course covers such topics as developing flowcharts, algorithms and pseudocode, and introduces students to variables, operators, conditional statements, looping statements, data structures, error-handling and debugging, and user interface design. The course assumes no programming background. (Prerequisites: This class is restricted to NTID supported students who have completed NACT-170 with a grade of C or better and one (1) math class NMTH-140 or above or equivalent courses.) Lec/Lab 4 (Fall).",
    "This course focuses on the industry-standard tools used to create the visual elements of user interfaces for varying screen sizes and devices. Students in this course will identify common design elements and the techniques used to create these elements. Applying the design concepts, principles, theories and techniques learned in this course will increase students’ ability and preparation to design future interfaces that are intuitive and user-friendly. Students are expected to deliver projects with good application of responsive design layouts, typography, color, and other graphics. (NTID Supported Students.) Lec/Lab 4 (Fall).",
    "This course will provide students with a study of the fundamental concepts, logical structures, and algorithms inherent to computer programming. Students will learn how to write basic object-oriented programs in a contemporary programming language with a focus on mobile application development.",
    "This course covers the fundamentals of computational problem analysis and problem-solving methodologies. Students will be introduced to logical strategies and structures that can be used to frame narrative problems into programmable structures, to develop testing plans, to effectively analyze and remove errors, and to ensure the resulting solution satisfies the original requirements. As part of this exploration, students will learn to independently and collaboratively solve computational problems using various methods.",
    "This course provides students with an introduction to internet and web technologies, and to development on Macintosh/UNIX computer platforms. Topics include HTML and CSS, CSS3 features, digital images, web page design and website publishing. Emphasis is placed on fundamentals, concepts and standards. Additional topics include the user experience, mobile design issues, and copyright/intellectual property considerations. Exercises and projects are required.",
    "This course builds on the basics of web page development that are presented in Web and Mobile I and extends that knowledge to focus on theories, issues, and technologies related to the design and development of web sites. An overview of web design concepts, including usability, accessibility, information architecture, and graphic design in the context of the web will be covered. Introduction to web site technologies, including HTTP, web client and server programming, and dynamic page generation from a database also will be explored. Development exercises are required.",
    "This course explores how the fields of psychology, digital design, and computing converge in the design, development, and evaluation of new technologies that people find effective and enjoyable to use.  Students will investigate the field of human-computer interaction (HCI), with a focus on how users' various sensory, motor, and cognitive abilities are essential to their successful use of technology. Students will be exposed to modern research methods and paradigms in field of human-computer interaction, including predictive modeling, heuristic evaluation, interpretive methods, and experimental user testing.  Students will learn key design principles and guidelines and apply them to analyze existing designs and conduct a design process that is centered on human users of technology.",
    "This course is a continuation of NACA-120 that delves further into problem solving and software development with a focus on object-oriented design and development. Students will continue to learn basic software design, incremental development, testing, and verification. Students will also learn key topics including classes, objects, encapsulation, inheritance, interfaces, software design comprised of multiple classes, UML (Unified Modeling Language) as a design/documentation tool, data structures, exception/error handling, and file I/O. (Prerequisites: NACA-120 or NMAD-180 or equivalent course with a grade of C or better.) Lec/Lab 6 (Fall, Spring).",
    "This course is an introduction to designing, prototyping, and creating applications and web applications for mobile devices. These devices include a unique set of hardware and communications capabilities, incorporate novel interfaces, are location aware, and provide persistent connectivity. Topics covered include user interaction patterns, connectivity, interface design, software design patterns, and application architectures. Programming projects are required. (Prerequisites: ISTE-240 or IGME-330 or equivalent course.) Lec/Lab 3 (Fall, Spring).",
    "This course introduces statistical methods of extracting meaning from data, and basic inferential statistics. Topics covered include data and data integrity, exploratory data analysis, data visualization, numeric summary measures, the normal distribution, sampling distributions, confidence intervals, and hypothesis testing. The emphasis of the course is on statistical thinking rather than computation. Statistical software is used. (Prerequisites: Any 100 level MATH course, or NMTH-260 or NMTH-272 or NMTH-275 or (NMTH-250 with a C- or better) or a Math Placement Exam score of at least 35.) Lecture 3 (Fall, Spring, Summer).",
    "This course is an elementary introduction to the topics of regression and analysis of variance. The statistical software package Minitab will be used to reinforce these techniques. The focus of this course is on business applications. This is a general introductory statistics course and is intended for a broad range of programs. (Prerequisites: STAT-145 or equivalent course.) Lecture 6 (Fall, Spring, Summer).",
    "A second course that delves further into computational problem solving, now with a focus on an object-oriented perspective. There is a continued emphasis on basic software design, testing & verification, and incremental development. Key topics include theoretical abstractions such as classes, objects, encapsulation, inheritance, interfaces, polymorphism, software design comprising multiple classes with UML, data structures (e.g. lists, trees, sets, maps, and graphs), exception/error handling, I/O including files and networking, concurrency, and graphical user interfaces. Additional topics include basic software design principles (coupling, cohesion, information expert, open-closed principle, etc.), test driven development, design patterns, data integrity, and data security. (Prerequisite: C- or better in SWEN-123 or CSEC-123 or GCIS-123 or equivalent course.) Lab 6 (Fall, Spring, Summer).",
    "This course will serve as an introduction to research methods in psychology, with the goal of understanding research design, analysis and writing. Topics include examining the variety of methods used in psychology research, understanding research ethics, developing empirical hypotheses, designing experiments, understanding statistical concepts, interpreting results, and writing research and review papers in APA style. This is a required course for all psychology majors, and is restricted to students in the psychology program.",
    "This course will serve as an advanced research methods course in psychology, and will build on the foundational knowledge presented in Research Methods I. Topics and tasks for this course include designing single and multi-factor experiments, interpreting correlational research, completing statistical analyses appropriate to design, completing and analyzing an IRB application, understanding observational and survey research, and presenting results in APA style. This is a required course for all psychology majors, and is restricted to students in the psychology program.",
    "Through formal studies and perceptual understanding, including aesthetics, graphic form, structure, concept development, visual organization methods and interaction principles, students will design graphical solutions to communication problems for static and interactive projects. Students will focus on creating appropriate and usable design systems through the successful application of design theory and best practices.  Assignments exploring aspects of graphic imagery, typography, usability and production for multiple digital devices and formats will be included.",
    "This course examines how people perceive, learn, represent, remember and use information. Contemporary theory and research are surveyed in such areas as attention, pattern and object recognition, memory, knowledge representation, language acquisition and use, reasoning, decision making, problem solving, creativity, and intelligence. Applications in artificial intelligence and human/technology interaction may also be considered. (Prerequisites: PSYC-101 or PSYC-101H or completion of one (1) 200 level PSYC course.) Lecture 3 (Fall, Spring, Summer).",
    "This course will explore the analysis, design, development, and implementation of client-side programming in the context of Internet technologies, mobile devices, Web-based client systems and desktop applications. Students will learn to design and build usable and effective interactive systems, clients, and interfaces. Key features addressed will include browser and platform compatibility, object reusability, bandwidth and communications issues, development environments, privacy and security, and related technologies and APIs. Programming is required.",
    "Writing Seminar is a three-credit course limited to 19 students per section. The course is designed to develop first-year students’ proficiency in analytical and rhetorical reading and writing, and critical thinking. Students will read, understand, and interpret a variety of non-fiction texts representing different cultural perspectives and/or academic disciplines. These texts are designed to challenge students intellectually and to stimulate their writing for a variety of contexts and purposes. Through inquiry-based assignment sequences, students will develop academic research and literacy practices that will be further strengthened throughout their academic careers. Particular attention will be given to the writing process, including an emphasis on teacher-student conferencing, critical self-assessment, class discussion, peer review, formal and informal writing, research, and revision. Small class size promotes frequent student-instructor and student-student interaction. The course also emphasizes the principles of intellectual property and academic integrity for both current academic and future professional writing. Lecture 3 (Fall, Spring, Summer)."
  ]
}